{
    "sigma_query_format": "es-qs",
    "sigma_params": {
        "--backend-option": [
            ""
        ]
    },
    "credentials": {    
        "username": "",
        "password": "",
        "siem_url": "",
        "apikey": ""
    },
    "notes_folder": "",
    "settings": {
        "rule_id": "",
        "id": "",
        "author":[],
        "from":"now-15m",
        "index":["*"],
        "interval":"5m",
        "language":"lucene",
        "output_index":".siem-signals-default",
        "references":[],
        "false_positives":[],
        "risk_score":0,
        "name":"",
        "description":"",
        "query":"",
        "severity":"",
        "tags":[],
        "to":"now",
        "type":"query",
        "threat":[],
        "throttle":"no_actions",
        "threshold": {
            "field": null,
            "value": null
        },
        "note": "",
        "actions": []
    }
}
