{
    "sigma_query_format": "es-qs",
    "credentials": {    
        "kibana_username": "",
        "kibana_password": "",
        "kibana_url": ""
    },
    "settings": {
        "rule_id": "",
        "id": "",
        "author":[],
        "from":"now-15m",
        "index":["*"],
        "interval":"5m",
        "language":"kuery",
        "output_index":".siem-signals-default",
        "references":[],
        "false_positives":[],
        "risk_score":0,
        "name":"",
        "description":"",
        "query":"",
        "severity":"",
        "tags":[],
        "to":"now",
        "type":"query",
        "threat":[],
        "throttle":"no_actions",
        "timeline_id":"",
        "timeline_title": ""
    }
}
